{
    "version": "https://jsonfeed.org/version/1",
    "title": "Labaguna",
    "description": "",
    "home_page_url": "https://labaguna.com",
    "feed_url": "https://labaguna.com/feed.json",
    "user_comment": "",
    "author": {
        "name": "Johan"
    },
    "items": [
        {
            "id": "https://labaguna.com/covid-19-lesson-1.html",
            "url": "https://labaguna.com/covid-19-lesson-1.html",
            "title": "COVID-19 Lesson 1",
            "summary": " The first lesson I learnt from the corona virus crisis is that it can affect anyone regardless of their&hellip;",
            "content_html": "<p><!-- wp:paragraph --></p>\n<p>The first lesson I learnt from the corona virus crisis is that it can affect anyone regardless of their social status, their wealth, their position, etc. It is an invisible force that shows no partiality.&nbsp;</p>\n<p>\n<!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>This crisis is a wake up call for humanity to face the other invisible force that so many of us have taken for granted and often ignore or even blatantly deny the existence of. Yes, I'm referring to God. Just like the virus, God shows no partiality to man.&nbsp;</p>\n<p>\n<!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>As it is written in the Bible, Acts 10 verse 34-35:</p>\n<p>\n<!-- /wp:paragraph --></p>\n<p><!-- wp:quote --></p>\n<blockquote class=\"wp-block-quote\">\n<p>So Peter opened his mouth and said: “Truly I understand that God shows no partiality, but in every nation anyone who fears him and does what is right is acceptable to him.</p>\n</blockquote>\n<p>\n<!-- /wp:quote --></p>\n",
            "image": "https://labaguna.com/media/posts/68/137ff-w9keokhajkw.jpg",
            "author": {
                "name": "Johan"
            },
            "tags": [
            ],
            "date_published": "2020-03-23T08:58:00+11:00",
            "date_modified": "2021-05-05T22:05:56+10:00"
        },
        {
            "id": "https://labaguna.com/student-to-teacher-ratio.html",
            "url": "https://labaguna.com/student-to-teacher-ratio.html",
            "title": "Student to Teacher Ratio",
            "summary": " One of the criteria used to compare schools is the student-to-teacher ratio. It is an indication of the staffing&hellip;",
            "content_html": "<p><!-- wp:paragraph --></p>\n<p>One of the criteria used to compare schools is the student-to-teacher ratio. It is an indication of the staffing resources of the school. The number usually ranges between 10 to 20. So a ratio of 10 means there are 10 students for each teacher at in school.</p>\n<p>\n<!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Generally you would prefer a lower number as it means more teaching resource for each student. If lower teacher-to-student ratio is better, then the conjecture is that a ratio of 1 is the best. It is basically like private tuition. But this is exactly what homeschooling is about. Giving your children the best teaching resource.</p>\n<p>\n<!-- /wp:paragraph --></p>\n",
            "image": "https://labaguna.com/media/posts/67/3e340-hes6nuc1mvc.jpg",
            "author": {
                "name": "Johan"
            },
            "tags": [
            ],
            "date_published": "2020-03-10T22:17:00+11:00",
            "date_modified": "2021-05-05T22:05:56+10:00"
        },
        {
            "id": "https://labaguna.com/why-i-am-not-a-postmodernist.html",
            "url": "https://labaguna.com/why-i-am-not-a-postmodernist.html",
            "title": "Why I am not a postmodernist",
            "summary": " One of the fundamental tenets of postmodernism is that there is no absolute truth. Now if that is true,&hellip;",
            "content_html": "<p><!-- wp:paragraph --></p>\n<p>One of the fundamental tenets of postmodernism is that there is no absolute truth. Now if that is true, then it is an absolute truth. But that means there is absolute truth, and therefor the tenet is false. </p>\n<p>\n<!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>When you deconstruct the foundation of where you stand on, eventually it comes crumbling down along with yourself.</p>\n<p>\n<!-- /wp:paragraph --></p>\n",
            "image": "https://labaguna.com/media/posts/66/2463e-photo-1518775804899-fa139ff3439e.jpg",
            "author": {
                "name": "Johan"
            },
            "tags": [
            ],
            "date_published": "2018-10-11T20:49:00+11:00",
            "date_modified": "2021-05-05T22:05:56+10:00"
        },
        {
            "id": "https://labaguna.com/learn-how-to-get-property-reports-and-save-hours-of-disappointing-site-inspection.html",
            "url": "https://labaguna.com/learn-how-to-get-property-reports-and-save-hours-of-disappointing-site-inspection.html",
            "title": "Learn how to get property reports and save hours of disappointing site inspection",
            "summary": " Finding your dream country property is hard and requires a lot of time and energy. Although it is fun&hellip;",
            "content_html": "<p><!-- wp:paragraph --></p>\n<p>Finding your dream country property is hard and requires a lot of time and energy. Although it is fun to flip through glossy photos online, actual trip to site often disappoint. Not to mention the feeling of having wasted a good part of the day on the road. Of course, the first few trips are exciting. But after the fifth or so, you start to get tired. For every disappointing site inspection, doubt about having a country property increases. You start to wonder, does God actually want you to make this move to the country?</p>\n<p>\n<!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>We have gone through this process ourselves twice. The first one was in 2009. It took us six months before we find the right land. With every inspection, we grew smarter. We not only read the ad carefully, but we rely heavily on the property reports available for free from Land Victoria.</p>\n<p>\n<!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>Getting property reports is easy. You just need to follow a few simple steps. The two most useful reports are the basic property report and the planning property report. The basic report has information about the shire it is in, basic zoning etc. The planning property report has the detailed zoning and overlay information which is absolutely critical to understand. It dictates what can be done on the land and the challenges. If you are like most people, you will want to build a dwelling. Having the right zoning will save you lots of headache and heartache down the track.</p>\n<p>\n<!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p>If you don't know how to get property reports in Victoria, please download this free PDF containing a step-by-step instruction. Spend a few minutes and you will be much wiser on deciding if a property is worth inspecting or not.</p>\n<p>\n<!-- /wp:paragraph --></p>\n<p><!-- wp:paragraph --></p>\n<p><a href=\"https://wp.labaguna.com/wp-content/uploads/2017/03/how-to-get-property-planning-reports.pdf\">How to get property planning reports</a></p>\n<p>\n<!-- /wp:paragraph --></p>\n",
            "image": "https://labaguna.com/media/posts/65/dsc05978.jpg",
            "author": {
                "name": "Johan"
            },
            "tags": [
            ],
            "date_published": "2017-05-06T23:19:49+10:00",
            "date_modified": "2021-05-05T22:05:56+10:00"
        },
        {
            "id": "https://labaguna.com/how-to-find-agistment-in-australia.html",
            "url": "https://labaguna.com/how-to-find-agistment-in-australia.html",
            "title": "How to find agistment in Australia",
            "summary": "There are several agistment directory in Australia, but most are not uptodate and they charge high listing fees. We aim&hellip;",
            "content_html": "<p>There are several agistment directory in Australia, but most are not uptodate and they charge high listing fees. We aim to change that by making an agistment directory that offers free listing. <a href=\"http://dailygraze.com.au\">DailyGraze.com.au</a> empowers livestock owners and landowners to create and maintain their own listings. We hope that this service will help farmers seeking agistment and offering agistment to easily find one another.</p>\n",
            "image": "https://labaguna.com/media/posts/64/sheep_fxjskn.png",
            "author": {
                "name": "Johan"
            },
            "tags": [
            ],
            "date_published": "2016-03-31T22:55:53+11:00",
            "date_modified": "2021-05-05T22:05:56+10:00"
        },
        {
            "id": "https://labaguna.com/dont-waste-your-holiday.html",
            "url": "https://labaguna.com/dont-waste-your-holiday.html",
            "title": "Don&#x27;t waste your holiday",
            "summary": "We all know how it goes when we go for a holiday. The excitement goes up in anticipation, and before&hellip;",
            "content_html": "<p>We all know how it goes when we go for a holiday. The excitement goes up in anticipation, and before long it comes down and we are back to where we started. Even worse, we feel exhausted after the long journey and late nights during the break. Yet we still go through the motion nonetheless.  </p>\n<p>It appears that the system of work nowadays makes us crave for a break. We just want to run away even for a little while from the daily routine. It doesn't matter where, as long as we can get our mind off work.</p>\n<p>Jesus said, \"Come to me, all who labor and are heavy laden, and I will give you rest.\" - Matthew 11:28. We have to understand that Jesus knows what he is talking about. He walked on earth among the sick and the hungry. He suffered much leading to his agonizing death on the cross. If you think Buddha is great, having left his palace and joined the common multitude, Jesus is at least ten times greater, as he left his heavenly abode. He came from the highest place, down to the lowliest.  </p>\n<p>When Jesus says \"I will give you rest\", that's what he will really give us, and it will be a true lasting rest. Not just a little break that at the end makes us even more exhausted. </p>\n<p>So for this long weekend, I'd encourage you instead of having a holiday, have a Holy Day. Join your local church for the Good Friday service and Easter Sunday service. If you are in Melbourne and don't have a church, come join us at <a href=\"http://griimelbourne.org/event.aspx?id=15979&amp;name=Kebaktian-Paskah-Minggu-sore\">GRII Melbourne</a>.</p>\n\n",
            "image": "https://labaguna.com/media/posts/63/frog_razznl.jpg",
            "author": {
                "name": "Johan"
            },
            "tags": [
            ],
            "date_published": "2016-03-24T13:52:11+11:00",
            "date_modified": "2021-05-05T22:05:56+10:00"
        },
        {
            "id": "https://labaguna.com/proverbs-2819.html",
            "url": "https://labaguna.com/proverbs-2819.html",
            "title": "Proverbs 28:19",
            "summary": "The link between working the land and having bread on the table seems remote for most city dwellers. We don't&hellip;",
            "content_html": "<p>The link between working the land and having bread on the table seems remote for most city dwellers. We don't grow grains in the backyard, mill the grains into flour and then bake it into bread.&nbsp;</p>\n<p>Nevertheless the biblical message is applicable. Those who are dilligent, will not lack a paying job, and will have money to buy food. But those who slack, will have trouble finding a job.&nbsp;</p>\n<p>Still the question remains. Should we be working the land still? Adam and Eve were tasked to tend the garden. Should we regard that initial vocation more highly?&nbsp;</p>\n<p>Those who take for granted the food available at the supermarket should ponder and do some research on the effects of industrialized farming.&nbsp;</p>\n",
            "image": "https://labaguna.com/media/posts/62/img_2225_qamfdz.jpg",
            "author": {
                "name": "Johan"
            },
            "tags": [
            ],
            "date_published": "2015-11-28T23:19:07+11:00",
            "date_modified": "2021-05-05T22:05:56+10:00"
        },
        {
            "id": "https://labaguna.com/who-can-understand-your-way.html",
            "url": "https://labaguna.com/who-can-understand-your-way.html",
            "title": "Who can understand your way?",
            "summary": "From today's reading, the question is asked in Proverbs 20:24: \"A man's steps are from the LORD; how then can&hellip;",
            "content_html": "<p>From today's reading, the question is asked in Proverbs 20:24: \n\"A man's steps are from the LORD; how then can man understand his way?\"\nThe writer understands that God determines his steps. And that he is not in control of his own life. But that leaves him wondering, how can he understand where he is going?</p>\n<p>The answers is in 1 Corinthians 2:11-12:\n\"11 For who knows a person's thoughts except the spirit of that person, which is in him? So also no one comprehends the thoughts of God except the Spirit of God. 12 Now we have received not the spirit of the world, but the Spirit who is from God, that we might understand the things freely given us by God.\"</p>\n<p>So to understand where we are going, we need two things:</p>\n<p>1. First we need to understand that God determines our steps. We may make plans but ultimately it is God who decides where we will be.</p>\n<p>2. We need the Spirit of God in us. That is we need to be born of the spirit. To put on a new self, and as in Collosians 3:17 \"And whatever you do, in word or deed, do everything in the name of the Lord Jesus, giving thanks to God the Father through him.</p>\n<p>Have a blessed way.</p>\n",
            "image": "https://labaguna.com/media/posts/61/img_1126-1_rzub2h.jpg",
            "author": {
                "name": "Johan"
            },
            "tags": [
            ],
            "date_published": "2015-08-06T07:27:04+10:00",
            "date_modified": "2021-05-05T22:05:56+10:00"
        },
        {
            "id": "https://labaguna.com/one-thing-i-learnt-from-the-art-of-work.html",
            "url": "https://labaguna.com/one-thing-i-learnt-from-the-art-of-work.html",
            "title": "One thing I learnt from The Art of Work",
            "summary": "<p>I recently finished reading \"The Art of Work\" by Jeff Goins. He describes 7 elements of a calling and illustrates each with beautiful moving stories. Stories of ordinary people like us who have found their calling, resulting in great impact on many people's lives.</p>\n",
            "content_html": "<p>I recently finished reading \"The Art of Work\" by Jeff Goins. He describes 7 elements of a calling and illustrates each with beautiful moving stories. Stories of ordinary people like us who have found their calling, resulting in great impact on many people's lives.</p>\n\nOne of the takeaway from that book for me is that a calling is not just one thing. It is not just my work. But it is my entire life. It's my life's mission. And yes, a significant part would be my work, but it is also my family, my leisure, and my legacy. In a way, yes, a calling is just one thing, but one wholistic thing encompassing your entire life.</p>\n<p>So if you are feeling stuck at work, don't despair. It is only a part of your calling. Don't forget that your family is your calling too. Your ministry is your calling. Your leisure time is your calling. And what you impart to other people along the way is also your calling.</p>\n<p>In the coming weeks, I will be exploring more about one's calling and what to do when you feel stuck at where you are now. Please subscribe to our newsletter below to be notified of new articles.</p>\n",
            "image": "https://labaguna.com/media/posts/60/9e235-mybhn8kaaec.jpg",
            "author": {
                "name": "Johan"
            },
            "tags": [
            ],
            "date_published": "2015-07-02T11:52:09+10:00",
            "date_modified": "2021-05-05T22:05:56+10:00"
        },
        {
            "id": "https://labaguna.com/when-good-things-become-the-norm.html",
            "url": "https://labaguna.com/when-good-things-become-the-norm.html",
            "title": "When good things become the norm",
            "summary": "There is an economic law called the law of diminishing returns. Basically it means that the value of an item&hellip;",
            "content_html": "<p>There is an economic law called the law of diminishing returns. Basically it means that the value of an item decreases as we have more of it. For example, you may be willing to pay $2 for an ice cream. And you really enjoy eating it. When offered a second serve you hesitate. But at a discounted price of $1, you take it. After that you are very full and do not want any more even if it is free. Well okay, it's free so you take the third one and you feel a bit sick after that. </p>\n<p>This applies to many good things in life. The more we have of it, the less we value it. Until eventually we take them for granted and no longer be grateful for them. </p>\n<blockquote>Better is a little with the fear of the LORD than great treasure and trouble with it.  - Proverbs 15:16</blockquote>\n</p>\n",
            "image": "https://labaguna.com/media/posts/59/bd338-2tlrezi7bug.jpg",
            "author": {
                "name": "Johan"
            },
            "tags": [
            ],
            "date_published": "2015-06-25T23:40:06+10:00",
            "date_modified": "2021-05-05T22:05:56+10:00"
        }
    ]
}
